//接收礼物时验证正确性
var imgHost = "http://114.215.19.179:8002/"
var gifts = {
  aircraft:{
    price:388
  },
  ferrari:{
  	price:1111
  },
  cuke:{
  	price:38
  },
  injections:{
  	price:88
  },
  kiss:{
  	price:8
  },
  durex:{
  	price:58
  },
  porsche:{
  	price:188
  },
  money:{
  	price:888
  },
  cupidgirl:{
  	price:588
  },
}
//礼物列表
let giftsList = [
  /*--礼物代号----礼物名称--价格-备注1----
   * 
   * 备注1：0：大礼物，1：连击礼物（属于小礼物），-1：非连击礼物（属于小礼物）
   */
  ['kiss',      '么么哒',  8,  1],
  ['cuke',      '小黄瓜',  38, -1],
  ['durex',     '避孕套',  58, -1],
  ['injections','兴奋剂',  88, -1],
  ['porsche',   '保时捷',  188,0],
  ['aircraft',  '开飞机',  388, 0],
  ['cupidgirl', '爱神之箭',588, 0],
  ['money',     '发财树',  888,0]
]
//表情列表

let faceData = {
  '微笑':'😀',
  '大笑':'😁',
  '笑哭':'😂',
  '哈哈':'😄',
  '尴尬':'😅',
  '好玩':'😆',
  '挂了':'😇',
  '好的':'😉',
  '笑笑':'😊',
  '啦啦':'😋',
  '安逸':'😌',
  '色色':'😍',
  '秋波':'😘',
  '亲亲':'😙',
  '调皮':'😜',
  '偷笑':'😝',
  '酷':'😎',
  '得意':'😏',
  '呵呵':'😶',
  '嗯啊':'😑',
  '好吧':'😒',
  '是吗':'😳',
  '唉':'😞',
  '惊讶':'😟',
  '生气':'😠',
  '发火':'😡',
  '无助':'😔',
  '不开心':'😕',
  '挣扎':'😣',
  '折磨':'😖',
  '难受':'😫',
  '火大':'😤',
  '天呐':'😮',
  '惊恐':'😱',
  '震惊':'😨',
  '汗颜':'😰',
}
module.exports = {gifts,giftsList,faceData,imgHost}
