var hcConfig = {
  "任选":{
    "普通玩法":[{
      "name": "任选哈",
      "mode": "A10",
      "tip": "从01-80中选择1个号码组成一注，当期开奖结果的20个号码中包含所选号码，即可中奖，奖金",
      "group": "任选",
      "subGroup": "普通玩法",
      "tag": "任选一",
      "eg":["01","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "default":true
    },{
      "name": "任选二",
      "mode": "A11",
      "tip": "从01-80中选择2-8个号码，当期开奖结果的20个号码中包含所选号码中的两个，即可中奖，奖金",
      "group": "任选",
      "subGroup": "普通玩法",
      "eg":["01 02","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "tag": "任选二"
    },{
      "name": "任选三",
      "mode": "A12",
      "tip": "从01-80中选择3-8个号码，当期开奖结果的20个号码中包含所选号码中的三个，即可中奖。 ",
      "group": "任选",
      "subGroup": "普通玩法",
      "eg":["01 02 03","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "tag": "任选三"
    },{
      "name": "任选四",
      "mode": "A13",
      "tip": "从01-80中选择4-8个号码，当期开奖结果的20个号码中包含所选号码中的四个，即可中奖。 ",
      "group": "任选",
      "subGroup": "普通玩法",
      "eg":["01 02 03 04","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "tag": "任选四"
    },{
      "name": "任选五",
      "mode": "A14",
      "tip": "从01-80中选择5-8个号码，当期开奖结果的20个号码中包含所选号码中的五个，即可中奖。 ",
      "group": "任选",
      "subGroup": "普通玩法",
      "eg":["01 02 03 04 05","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "tag": "任选五"
    },{
      "name": "任选六",
      "mode": "A15",
      "tip": "从01-80中选择6-8个号码，当期开奖结果的20个号码中包含所选号码中的六个，即可中奖。 ",
      "group": "任选",
      "subGroup": "普通玩法",
      "eg":["01 02 03 04 05 06","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "tag": "任选六"
    },{
      "name": "任选七",
      "mode": "A16",
      "tip": "从01-80中选择7-8个号码，当期开奖结果的20个号码中包含所选号码中的七个，即可中奖。 ",
      "group": "任选",
      "subGroup": "普通玩法",
      "eg":["01 02 03 04 05 06 07","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "tag": "任选七"
    }]
  }
}

export {hcConfig}