var str49 = '从1-49中任选1个或多个号码，每个号码为一注，所选号码在开奖号码前六位中存在，即为中奖。奖金'
var getZTStr = (numStr)=>`从1-49中任选1个或多个号码，每个号码为一注，所选号码与开奖号码第${numStr}位相同，即为中奖。奖金`
var getBZStr = (numStr)=>`至少选择${numStr}个号码，每${numStr}个号码为一注，所有号码均为在开奖号码中出现，即为中奖。奖金`
var getZMLMStr = (numStr)=>`开奖号码第${numStr}位，大于或等于25为大，小于或等于24为小；奇数为单，偶数为双；和单和双为两个数相加后得数的单双；尾大尾小即看个位数值，小于等于4为小，大于4为大；为49时为和，不算任何大小单双，但算波色。（每个按钮单独显示赔率）`

var hcConfig = {
  "特码":{
    "特码":[{
      "name": "直选",
      "mode": "A1",
      "tip": str49,
      "group": "特码",
      "subGroup": "特码",
      "tag": "直选",
      "eg":[],
      "default":true
    },{
      "name": "两面",
      "mode": "A2",
      "tip": "开奖号码最后一位为特码。大于或等于25为特码大，小于或等于24为特码小；奇数为单，偶数为双；特码两个数相加后得数，奇数为合单，偶数为合双，小于等于6为合小，大于6为合大；尾大尾小即看特码个位数值，小于等于4为小，大于4为大；特码为49时为和，不算任何大小单双，但算波色。（每个按钮单独显示赔率）",
      "group": "特码",
      "subGroup": "特码",
      "eg":["01 02","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "tag": "两面"
    }]
  },
  "正码":{
    "正码":[{
      "name": "任选",
      "mode": "B1",
      "tip": str49,
      "group": "正码",
      "subGroup": "正码",
      "tag": "任选",
      "eg":[],
      "default":true
    },
    {
      "name": "正码合",
      "mode": "B2",
      "tip": "计算开奖号码前六位求和的值，小于150为总和小，大于等于150为总和大，是奇数为总和单，偶数为总和双，和值的个位数小于5为总尾小，大于等于5为总尾大。（每个按钮单独显示赔率）",
      "group": "正码",
      "subGroup": "正码",
      "tag": "正码合",
      "eg":[],
    },
    {
      "name": "正一特",
      "mode": "B3",
      "tip": getZTStr('一'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正一特",
      "eg":[],
    },
    {
      "name": "正二特",
      "mode": "B4",
      "tip": getZTStr('二'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正二特",
      "eg":[],
    },
    {
      "name": "正三特",
      "mode": "B5",
      "tip": getZTStr('三'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正三特",
      "eg":[],
    },
    {
      "name": "正四特",
      "mode": "B6",
      "tip": getZTStr('四'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正四特",
      "eg":[],
    },
    {
      "name": "正五特",
      "mode": "B7",
      "tip": getZTStr('五'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正五特",
      "eg":[],
    },
    {
      "name": "正六特",
      "mode": "B8",
      "tip": getZTStr('六'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正六特",
      "eg":[],
    },
    {
      "name": "正一两面",
      "mode": "B9",
      "tip": getZMLMStr('一'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正一两面",
      "eg":[],
    },
    {
      "name": "正二两面",
      "mode": "B10",
      "tip": getZMLMStr('二'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正二两面",
      "eg":[],
    },
    {
      "name": "正三两面",
      "mode": "B11",
      "tip": getZMLMStr('三'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正三两面",
      "eg":[],
    },
    {
      "name": "正四两面",
      "mode": "B12",
      "tip": getZMLMStr('四'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正四两面",
      "eg":[],
    },
    {
      "name": "正五两面",
      "mode": "B13",
      "tip": getZMLMStr('五'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正五两面",
      "eg":[],
    },
    {
      "name": "正六两面",
      "mode": "B14",
      "tip": getZMLMStr('六'),
      "group": "正码",
      "subGroup": "正码",
      "tag": "正六两面",
      "eg":[],
    },
  ]},
  "连码":{
    "连码":[
      {
        "name": "三全中",
        "mode": "C1",
        "tip": '至少选择三个号码，每三个号码为一组合，若三个号码都是开奖号码之正码，即为中奖。奖金',
        "group": "连码",
        "subGroup": "连码",
        "tag": "三全中",
        "eg":[],
        "default":true
      },
      {
        "name": "三中二",
        "mode": "C2",
        "tip": '至少选择三个号码，每三个号码为一组合，若其中至少有两个是开奖号码中的正码，即为中奖。若中两码，叫三中二，奖金为xx元；若三码全中，叫三中二之中三，奖金',
        "group": "连码",
        "subGroup": "连码",
        "tag": "三中二",
        "eg":[],
      },
      {
        "name": "二全中",
        "mode": "C3",
        "tip": '至少选择两个号码，每二个码号为一组合，二个号码都是开奖码号之正码（不含特码），即为中奖。奖金',
        "group": "连码",
        "subGroup": "连码",
        "tag": "二全中",
        "eg":[],
      },
      {
        "name": "二中特",
        "mode": "C4",
        "tip": '至少选择两个号码，每二个号码为一组合，二个号码都是开奖号码（含特码），即为中奖。若两个都是正码，叫二中特之二中，奖金xx元。若选号中包含特码，叫二中特之中特，奖金',
        "group": "连码",
        "subGroup": "连码",
        "tag": "二中特",
        "eg":[],
      },
      {
        "name": "特串",
        "mode": "C5",
        "tip": '至少选择两个号码，每二个号码为一组合，其中一个是正码，一个是特别号码，即为中奖。奖金',
        "group": "连码",
        "subGroup": "连码",
        "tag": "特串",
        "eg":[],
      },
    ]
  },
  "半波":{
    "半波":[
      {
        "name": "特码半波",
        "mode": "D1",
        "tip": "根据特码对应的特性来区分。分为红蓝绿三个波色，以及号码大于或等于25为大，小于或等于24为小；奇数为单，偶数为双；合单合双为开奖号的十位与个位相加后得数的单双。下注内容与号码特性完全吻合即为中奖。（每个按钮单独显示赔率）",
        "group": "半波",
        "subGroup": "半波",
        "tag": "特码半波",
        "eg":[],
        "default":true
      }
    ]
  },
  "生肖":{
    "生肖":[
      {
        "name": "特肖",
        "mode": "E1",
        "tip": "从十二生肖中任选1个或多个，每个生肖为一注，所选生肖与特码对应的生肖相同，即为中奖。",
        "group": "生肖",
        "subGroup": "生肖",
        "tag": "特肖",
        "eg":[],
        "default":true
      },
      {
        "name": "一肖",
        "mode": "E2",
        "tip": "从十二生肖中任选1个或多个，每个生肖为一注，开奖号码（含特码）中含有投注所属生肖，即为中奖。",
        "group": "生肖",
        "subGroup": "生肖",
        "tag": "一肖",
        "eg":[],
      },
      {
        "name": "二肖连",
        "mode": "E3",
        "tip": "至少选择两个生肖，每二个生肖为一组合，开奖号码（含特码）中含有投注所属全部生肖，即为中奖。",
        "group": "生肖",
        "subGroup": "生肖",
        "tag": "二肖连",
        "eg":[],
      },
      {
        "name": "三肖连",
        "mode": "E4",
        "tip": "至少选择三个生肖，每三个生肖为一组合，开奖号码（含特码）中含有投注所属全部生肖，即为中奖。",
        "group": "生肖",
        "subGroup": "生肖",
        "tag": "三肖连",
        "eg":[],
      },
      {
        "name": "四肖连",
        "mode": "E5",
        "tip": "至少选择四个生肖，每四个生肖为一组合，开奖号码（含特码）中含有投注所属全部生肖，即为中奖。",
        "group": "生肖",
        "subGroup": "生肖",
        "tag": "四肖连",
        "eg":[],
      },
    ]
  },
  "尾数":{
    "尾数":[
      {
        "name": "特码头尾",
        "mode": "F1",
        "tip": '',
        "group": "尾数",
        "subGroup": "尾数",
        "tag": "特码头尾",
        "eg":[],
        "default":true
      },
      {
        "name": "二尾连",
        "mode": "F2",
        "tip": "至少选择两个尾数，每两个尾数为一组合，开奖号码（含特码）中含有投注对应全部尾数，即为中奖。",
        "group": "尾数",
        "subGroup": "尾数",
        "tag": "二尾连",
        "eg":[],
      },
      {
        "name": "三尾连",
        "mode": "F3",
        "tip": "至少选择三个尾数，每三个尾数为一组合，开奖号码（含特码）中含有投注对应全部尾数，即为中奖。",
        "group": "尾数",
        "subGroup": "尾数",
        "tag": "三尾连",
        "eg":[],
      },
      {
        "name": "四尾连",
        "mode": "F4",
        "tip": "至少选择四个尾数，每四个尾数为一组合，开奖号码（含特码）中含有投注对应全部尾数，即为中奖。",
        "group": "尾数",
        "subGroup": "尾数",
        "tag": "四尾连",
        "eg":[],
      },
    ]
  },
  "不中":{
    "不中":[
      {
        "name": "五不中",
        "mode": "G1",
        "tip": getBZStr('五'),
        "group": "不中",
        "subGroup": "不中",
        "tag": "五不中",
        "eg":[],
        "default":true
      },
      {
        "name": "六不中",
        "mode": "G2",
        "tip": getBZStr('六'),
        "group": "不中",
        "subGroup": "不中",
        "tag": "六不中",
        "eg":[],
      },
      {
        "name": "七不中",
        "mode": "G3",
        "tip": getBZStr('七'),
        "group": "不中",
        "subGroup": "不中",
        "tag": "七不中",
        "eg":[],
      },
      {
        "name": "八不中",
        "mode": "G4",
        "tip": getBZStr('八'),
        "group": "不中",
        "subGroup": "不中",
        "tag": "八不中",
        "eg":[],
      },
      {
        "name": "九不中",
        "mode": "G5",
        "tip": getBZStr('九'),
        "group": "不中",
        "subGroup": "不中",
        "tag": "九不中",
        "eg":[],
      },
      {
        "name": "十不中",
        "mode": "G6",
        "tip": getBZStr('十'),
        "group": "不中",
        "subGroup": "不中",
        "tag": "十不中",
        "eg":[],
      },

    ]
  }
};

export {hcConfig}