var hcConfig = {
  "特码":{
    "特码":[{
      "name": "任选一",
      "mode": "A10",
      "tip": "从01-80中选择1个号码组成一注，当期开奖结果的20个号码中包含所选号码，即可中奖，奖金",
      "group": "任选",
      "subGroup": "普通玩法",
      "tag": "任选一",
      "eg":["01","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "default":true
    },{
      "name": "任选二",
      "mode": "A11",
      "tip": "从01-80中选择2-8个号码，当期开奖结果的20个号码中包含所选号码中的两个，即可中奖，奖金",
      "group": "任选",
      "subGroup": "普通玩法",
      "eg":["01 02","01 02 03 04 05 06 07 08 21 22 71 72 73 74 75 76 77 78 79 80"],
      "tag": "任选二"
    }]
  }
}

export {hcConfig}